###################################################################

# Created by write_sdc on Thu Nov 19 13:40:33 2020

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current uA
set_load -pin_load 15 [get_ports {sum[15]}]
set_load -pin_load 15 [get_ports {sum[14]}]
set_load -pin_load 15 [get_ports {sum[13]}]
set_load -pin_load 15 [get_ports {sum[12]}]
set_load -pin_load 15 [get_ports {sum[11]}]
set_load -pin_load 15 [get_ports {sum[10]}]
set_load -pin_load 15 [get_ports {sum[9]}]
set_load -pin_load 15 [get_ports {sum[8]}]
set_load -pin_load 15 [get_ports {sum[7]}]
set_load -pin_load 15 [get_ports {sum[6]}]
set_load -pin_load 15 [get_ports {sum[5]}]
set_load -pin_load 15 [get_ports {sum[4]}]
set_load -pin_load 15 [get_ports {sum[3]}]
set_load -pin_load 15 [get_ports {sum[2]}]
set_load -pin_load 15 [get_ports {sum[1]}]
set_load -pin_load 15 [get_ports {sum[0]}]
create_clock [get_ports clk]  -name clk_input  -period 1000  -waveform {0 500}
set_clock_uncertainty 0.002  [get_clocks clk_input]
set_input_delay -clock clk_input  0.002  [get_ports {in[63]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[62]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[61]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[60]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[59]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[58]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[57]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[56]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[55]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[54]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[53]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[52]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[51]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[50]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[49]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[48]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[47]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[46]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[45]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[44]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[43]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[42]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[41]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[40]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[39]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[38]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[37]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[36]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[35]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[34]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[33]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[32]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[31]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[30]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[29]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[28]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[27]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[26]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[25]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[24]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[23]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[22]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[21]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[20]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[19]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[18]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[17]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[16]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[15]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[14]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[13]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[12]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[11]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[10]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[9]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[8]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[7]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[6]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[5]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[4]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[3]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[2]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[1]}]
set_input_delay -clock clk_input  0.002  [get_ports {in[0]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[15]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[14]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[13]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[12]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[11]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[10]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[9]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[8]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[7]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[6]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[5]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[4]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[3]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[2]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[1]}]
set_output_delay -clock clk_input  0.002  [get_ports {sum[0]}]
